[
  {
    "date" : "October 2014",
    "content" : "<p>Jess and Jamie met at <a href='http://www.jamstudios.co.uk/' target='_blank'>Jam Studios</a> to practise a few songs. the set list was:</p><ul><li>Just a Girl - No Doubt</li><li>Want You To Want Me - Letters to Cleo</li></ul><p>Neither Jamie or Jess had ever been to Jam studios before this point, and they certainly hadn't met in person either. They'd been communicating via <a href='http://www.joinmyband.com' target='_blank'>JoinMyBand</a> before this point.</p><p>Andy was there to, providing the essential guitar parts, but shortly after the first session he decided that it wasn't for him.</p>"},
  {
    "date" : "November 2014",
    "content" :"<p>Jess and Jamie didn't take the loss of a guitarist as anything but a bump in the road. The continued on their quest for musical greatness. Jess had continued to look for a drummer while Jamie had some personal problems to figure out.</p><p>A break through with a guitarist happened part way through the month, as Joseph joined. Jess and Jamie travelled to the SkyRack to meet him and discuss our ideas for the band.</p>"
  },
  {
    "date" : "December 2014",
    "content": "<p>Jamie had finally sorted through the issues he was facing, and Jess and Joseph had found a drummer: Dave.</p><p>Because December is a busy time for everyone (because, you know, Christmas) the band didn't get much of a chance to meet and discuss thigs further.</p>"
  },
  {
    "date": "January 2015",
    "content" :"<p>With Christmas out of the way and a new year ahead of them, the band met for a pint or two to discuss the band and what our sound might be.</p><p>During a text conversation, Jamie and Jess come up with a potential name for the band:</p><blockquote>Jamie: J[ess], J[amie], J[oseph] and D[ave]... There's a name in there somewhere.</blockquote><blockquote>Jess: Triple J D... and coke hahaha</blockquote><blockquote>Jamie: Boom! I love it</blockquote><p>And so the band arranged their full practise session at <a href='http://www.eiger-studios.com/' target='_blank'>Eiger Studios</a> for Friday the 30th of January with the following set list:</p><ul><li>Just a Girl - No Doubt</li><li>Want You To Want Me - Letters to Cleo</li><li>Don't Stop Me Now - Queen</li><li>Zombie - The Cranberies</li></ul><p>Unfortunately, because Jamie is an idiot he didn't realise that he'd already had plans for that night. So, Jess hastily re-arranged for the following Tuesday.</p>"
  },
  {
    "date" : "February 2015",
    "content" : "<p>Tuesday 3rd of February 2015, will go down in the history books as when it all officially started. Jess, Jamie, Joseph and Dave turned up at Eiger Studios and brought the roof down. They had a fantastic time and played some amazing music.</p><p>Jess had the idea of including a song by The Offpring in the set list, and the band bounced ideas around before settling on Want You Bad. Then Dave had a stroke of genuis:</p><blockquote>I'd love to do some classic kids tv themes like thundercats/Ghostbusters or something like that. What do you all think?</blockquote>"
  },
  {
    "date": "March 2015",
    "content" : "<p>March, the band had been playing together for a month. Black Velvet was added to the setlist, which gave Joseph a chance to stretch his lead guitar muscles. Everytime the band played Black Velvet they had an amazing time, with extended outros and crazy endings.</p>"
  },
  {
    "date" : "Summer 2015",
    "content" : "<p>Over the summer and inbetween practise sessions, the Rebels became busy with personal life things. Practises where still being attended and great times where still had, but things got a little in the way.</p><p>This was further compounded when Joseph decided that he wanted to move on to other projects. This meant that practise sessions came to a stand still at the end of summer, and into the beginning of the Autumn. The Rebels decided to take a little time off to regroup and rest up.</p><p>It was also during this period that Jamie's brother (Mark) redesigned the band logo - the current version of this is used on the home page of the site.</p>"
  },
  {
    "date" : "December 2015",
    "content": "<p>During the Christmas period, Jamie decided to re-build the current website. It was all static HTML, but he'd decided to rebuild it using <a href='https://angularjs.org/' target='_blank'>Angular</a>. He really liked the outcome.</p>"
  },
  {
    "date" : "January 2016",
    "content" : "<p>A new beginning? Who can say? Why not check out the rest of the site and find out?</p>"
  }
]
